class Solution:
    '''
    Даны две строки s1 и s2.
    Разрешается удалять символы из любой строки.
    Удаление символа стоит столько, сколько его ASCII-код.
    Нужно сделать так, чтобы строки стали одинаковыми, и при этом
    суммарная стоимость удалённых символов была минимальной.
    Верни минимально возможную сумму ASCII-кодов удалённых символов.
    🧠 Что это значит простыми словами
    Ты можешь удалять буквы из s1 и s2
    В конце строки должны стать одинаковыми
    Каждая удалённая буква имеет «цену» = её ASCII-код
    Нужно удалить так, чтобы заплатить как можно меньше
    ❗ Переставлять символы нельзя — только удалять.
    🔢 ASCII-коды (для понимания)
    Символ	ASCII
    a	97
    b	98
    e	101
    s	115
    t	116
    📊 Пример 1 (из условия)
    Вход:
    s1 = "sea"
    s2 = "eat"
    Возможный вариант:
    Удаляем 's' из "sea" → 115
    Удаляем 't' из "eat" → 116
    Остаётся:
    "ea" == "ea"
    Сумма:
    115 + 116 = 231
    ✅ Это минимально возможная сумма.
    '''
    def minimumDeleteSum(self, s1: str, s2: str):
        if s1 == s2:
            return 0

        min_string = s2 if len(s2) < len(s1) else s1





sol = Solution()
sol.minimumDeleteSum(s1 = "sea", s2 = "eat")

print(f'---r`')
sol.minimumDeleteSum(s1 = "delete", s2 = "leet")