class Solution:
    '''
    Подсказка:
    Десятичное число называется деци-двоичным, если каждая его цифра — это либо 0, либо 1,
    и оно не содержит ведущих нулей. Например, 101 и 1100 являются деци-двоичными, а 112 и 3001 — нет.

    Дана строка n, представляющая положительное целое десятичное число. Верните минимальное
    количество положительных деци-двоичных чисел, необходимых для того, чтобы их сумма равнялась n.
    Пример 1:
    Вход: n = "32"
    Выход: 3
    Пояснение: 10 + 11 + 11 = 32
    '''
    def minPartitions(self, n: str) -> int:
        return max(list(map(int, list(n))))


sol = Solution()
print(sol.minPartitions('32'))