class Solution:
    '''
    Перевод задачи
    66. Plus One
    Дано большое целое число, представленное в виде массива цифр digits, где digits[i] — это i-я цифра числа.
    Цифры расположены слева направо от старшего разряда к младшему.
    Гарантируется, что число:
    не содержит ведущих нулей
    представлено корректно
    Требуется увеличить это число на единицу и вернуть результат в виде массива цифр.
    Объяснение простыми словами
    У тебя есть число, но:
    нельзя просто преобразовать его в int
    нельзя использовать большие числа напрямую
    Вместо этого:
    каждая цифра — отдельный элемент массива
    нужно реализовать школьное сложение +1
    Основная идея
    Начинаем с конца массива
    Прибавляем 1
    Если получаем 10 → пишем 0 и переносим 1 влево
    Если дошли до начала массива и всё ещё есть перенос → добавляем 1 в начало
    Примеры
    Пример 1
    Ввод: digits = [1, 2, 3]
    Число: 123
    123 + 1 = 124
    Вывод: [1, 2, 4]
    '''
    def plusOne(self, digits: list[int]) -> list[int]:
        digits[-1] += 1

        if digits[-1] == 10:
            if set(digits) == {9,10} or digits == [10]:
                return [1] + [0] * (len(digits))
            for num in range(len(digits)-1, -1, -1):
                if digits[num] == 10 or digits[num] == 9:
                    digits[num] = 0
                else:
                    digits[num] += 1
                    break
        return digits


sol = Solution()
print(sol.plusOne(digits=[1,3,9,9]))
print(sol.plusOne(digits=[1,2,9,8]))
print(sol.plusOne(digits=[9]))
