from math import remainder


class Solution:
    '''
    860. Размен лимонада
    У тебя есть палатка с лимонадом.
    Каждый лимонад стоит 5 долларов.
    Покупатели стоят в очереди и покупают лимонад по одному, в том порядке, в котором они указаны в массиве bills.
    Каждый покупатель:
    покупает ровно один лимонад
    платит купюрой $5, $10 или $20
    Ты обязан выдать правильную сдачу, чтобы в итоге каждый покупатель заплатил ровно $5.
    ⚠️ В начале у тебя нет никаких денег.
    ❓ Входные данные
    bills[i] — купюра, которой платит i-й покупатель
    ✅ Что нужно сделать
    Вернуть:
    true — если ты можешь выдать сдачу каждому покупателю
    false — если в какой-то момент не хватает сдачи
    💡 Ключевая идея задачи
    Ты не можешь брать деньги из будущего.
    Размен — только теми купюрами, которые уже получил ранее.
    🧠 Логика по шагам
    Цена лимонада = 5
    Если платят:
    $5 → сдача не нужна
    $10 → нужно дать $5
    $20 → нужно дать $15
    лучше всего: $10 + $5
    если нет → 3 × $5
    ✏️ Примеры
    ✅ Пример 1
    bills = [5, 5, 5, 10, 20]
    Что происходит:
    5 → ок
    5 → ок
    5 → ок
    10 → даём 5
    20 → даём 10 + 5
    ✔️ всем хватило сдачи
    ➡️ true
    '''
    def lemonadeChange(self, bills: list[int]) -> bool:
        changes = {
            5:0,
            10:0
        }
        for pay in bills:
            if pay == 5:
                changes[pay] += 1
            elif pay == 10:
                if changes[5]:
                    changes[5] -=1
                    changes[10] += 1
                else:
                    return False
            else:
                if changes[10] and changes[5]:
                    changes[10] -= 1
                    changes[5] -= 1
                elif changes[5] >= 3:
                    changes[5] -= 3
                else:
                    return False
        return True






sol = Solution()
print(sol.lemonadeChange(bills = [5,5,5,10,20]))
print()
print(sol.lemonadeChange(bills = [5,5,10,10,20]))
