import collections


class Solution:
    '''
    2570. Объединение двух двумерных массивов путем суммирования значений
    Условие задачи:

    Даны два отсортированных двумерных массива nums1 и nums2, где каждый элемент представлен в виде пары:

    [id, value]
    id — уникальный идентификатор,
    value — соответствующее значение.
    Необходимо объединить оба массива по id, суммируя значения для одинаковых id.
    Если id присутствует только в одном из массивов, его значение остается неизменным.
    Итоговый массив должен быть отсортирован по возрастанию id.

    Примеры
    Пример 1:
    Вход:
    nums1 = [[1,2],[2,3],[4,5]]
    nums2 = [[1,4],[3,2],[4,1]]

    Процесс объединения:
    id 1: 2 + 4 = 6
    id 2: 3 (только в nums1)
    id 3: 2 (только в nums2)
    id 4: 5 + 1 = 6
    Выход:
    [[1,6],[2,3],[3,2],[4,6]]
    '''

    def mergeArrays(self, nums1: list[list[int]], nums2: list[list[int]]) -> list[list[int]]:
        nums1, nums2 = {i: val for i, val in nums1}, {i: val for i, val in nums2}

        res = {

        }
        general_id = set(nums1.keys()) & set(nums2.keys())
        separate_id = set(nums1.keys()) ^ set(nums2.keys())

        for ids in list(general_id | separate_id):
            if ids in general_id:
                res.setdefault(ids, nums1[ids] + nums2[ids])
            if ids in separate_id:
                res.setdefault(ids, nums1[ids]) if ids in nums1 else res.setdefault(ids, nums2[ids])

        res = [[i, val] for i, val in res.items()]
        res.sort(key=lambda x: x[0])
        return res


# nums1 = [[1,2],[2,3],[4,5]]
# nums2 = [[1,4],[3,2],[4,1]]

# nums1 = [[148, 597], [165, 623], [306, 359], [349, 566], [403, 646], [420, 381], [566, 543], [730, 209], [757, 875],
#          [788, 208], [932, 695]]
# nums2 = [[74, 669], [87, 399], [89, 165], [99, 749], [122, 401], [138, 16], [144, 714], [148, 206], [177, 948],
#          [211, 653],
#          [285, 775], [309, 289], [349, 396], [386, 831], [403, 318], [405, 119], [420, 153], [468, 433], [504, 101],
#          [566, 128],
#          [603, 688], [618, 628], [622, 586], [641, 46], [653, 922], [672, 772], [691, 823], [693, 900], [756, 878],
#          [757, 952],
#          [770, 795], [806, 118], [813, 88], [919, 501], [935, 253], [982, 385]]

sol = Solution()
print(sol.mergeArrays(nums1, nums2))
