class Solution:
    '''
    🔤 Условие (перевод)
    Дан массив apple размера n, где apple[i] — количество яблок в i-м пакете.
    Также дан массив capacity размера m, где capacity[j] — вместимость j-й коробки.
    У тебя есть:
    n пакетов с яблоками
    m коробок с ограниченной вместимостью
    🔹 Задача:
    Вернуть минимальное количество коробок, которое нужно выбрать, чтобы разложить все яблоки из пакетов.
    ⚠️ Важно:
    Яблоки из одного пакета можно распределять по разным коробкам.
    🧠 Идея решения (коротко)
    Посчитать общее количество яблок
    Отсортировать коробки по вместимости по убыванию
    Брать самые вместительные коробки, пока их суммарная вместимость
    не станет ≥ общего числа яблок
    Количество взятых коробок — это ответ
    📘 Примеры
    ✅ Пример 1
    Ввод:
    apple = [1, 3, 2]
    capacity = [4, 3, 1, 5]
    Решение:
    Всего яблок: 1 + 3 + 2 = 6
    Сортируем коробки: [5, 4, 3, 1]
    Берём:
    5 → ещё не хватает (5 < 6)
    5 + 4 = 9 → хватает
    '''
    def minimumBoxes(self, apple: list[int], capacity: list[int]) -> int:

        capacity.sort(reverse=True)
        all_apples, ans = sum(apple), 0
        for cup in capacity:
            if all_apples <= 0:
                break
            all_apples -= cup
            ans += 1
        return ans


sol = Solution()
print(sol.minimumBoxes(apple = [1,3,2], capacity = [4,3,1,5,2]))